package Task1;

public class JavaBasicOptions {
    /* а:
    JVM - java virtual machine - отвечает за исполнение Java ;
    JRE - java runtime envirment - создает и запускает JVM ;
    JDK - java development kit - позволяет разработчикам создавать программы,
    которые могут выполняться и запускаться c помощью JVM и JRE;

    b: написать 3 плюса и недостатки java
+
    многопоточность ;
    ООП ;
    кроссплатформенность, возможность использования кода на разных ОС;
    возможность использования более старых версий языка ;

-
    строго типизированный, много кода;
    не высокая скорость компиляции;

    c: написать основные принципы ООП :

- Инкапсуляция ;
- Наследование ;
- Полиморфизм ;
- Абстракция ;

     */
}
